stm32duino/Arduino_Core_STM32/boards.txt
Maple.menu.opt.osstd=Smallest (-Os default)
Maple.menu.opt.oslto=Smallest (-Os) with LTO
Maple.menu.opt.oslto.build.flags.optimize=-Os -flto
Maple.menu.opt.oslto.build.flags.ldspecs=-flto
Maple.menu.opt.o1std=Fast (-O1)
Maple.menu.opt.o1std.build.flags.optimize=-O1
Maple.menu.opt.o1std.build.flags.ldspecs=
Maple.menu.opt.o1lto=Fast (-O1) with LTO
Maple.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Maple.menu.opt.o1lto.build.flags.ldspecs=-flto
Maple.menu.opt.o2std=Faster (-O2)
Maple.menu.opt.o2std.build.flags.optimize=-O2
Maple.menu.opt.o2std.build.flags.ldspecs=
Maple.menu.opt.o2lto=Faster (-O2) with LTO
Maple.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Maple.menu.opt.o2lto.build.flags.ldspecs=-flto
Maple.menu.opt.o3std=Fastest (-O3)
Maple.menu.opt.o3std.build.flags.optimize=-O3
Maple.menu.opt.o3std.build.flags.ldspecs=
Maple.menu.opt.o3lto=Fastest (-O3) with LTO
Maple.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Maple.menu.opt.o3lto.build.flags.ldspecs=-flto
Maple.menu.opt.ogstd=Debug (-g)
Maple.menu.opt.ogstd.build.flags.optimize=-g -Og
Maple.menu.opt.ogstd.build.flags.ldspecs=

RemRam.menu.opt.osstd=Smallest (-Os default)
RemRam.menu.opt.oslto=Smallest (-Os) with LTO
RemRam.menu.opt.oslto.build.flags.optimize=-Os -flto
RemRam.menu.opt.oslto.build.flags.ldspecs=-flto
RemRam.menu.opt.o1std=Fast (-O1)
RemRam.menu.opt.o1std.build.flags.optimize=-O1
RemRam.menu.opt.o1std.build.flags.ldspecs=
RemRam.menu.opt.o1lto=Fast (-O1) with LTO
RemRam.menu.opt.o1lto.build.flags.optimize=-O1 -flto
RemRam.menu.opt.o1lto.build.flags.ldspecs=-flto
RemRam.menu.opt.o2std=Faster (-O2)
RemRam.menu.opt.o2std.build.flags.optimize=-O2
RemRam.menu.opt.o2std.build.flags.ldspecs=
RemRam.menu.opt.o2lto=Faster (-O2) with LTO
RemRam.menu.opt.o2lto.build.flags.optimize=-O2 -flto
RemRam.menu.opt.o2lto.build.flags.ldspecs=-flto
RemRam.menu.opt.o3std=Fastest (-O3)
RemRam.menu.opt.o3std.build.flags.optimize=-O3
RemRam.menu.opt.o3std.build.flags.ldspecs=
RemRam.menu.opt.o3lto=Fastest (-O3) with LTO
RemRam.menu.opt.o3lto.build.flags.optimize=-O3 -flto
RemRam.menu.opt.o3lto.build.flags.ldspecs=-flto
RemRam.menu.opt.ogstd=Debug (-g)
RemRam.menu.opt.ogstd.build.flags.optimize=-g -Og
RemRam.menu.opt.ogstd.build.flags.ldspecs=
